CSI API ETABS v1

# cPropFrameGetConcreteL Method

---

Retrieves frame section property data for a concrete L frame section.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetConcreteL(
    	string Name,
    	ref string FileName,
    	ref string MatProp,
    	ref double T3,
    	ref double T2,
    	ref double Tf,
    	ref double TwC,
    	ref double TwT,
    	ref bool MirrorAbout2,
    	ref bool MirrorAbout3,
    	ref int Color,
    	ref string Notes,
    	ref string GUID
    )

    Function GetConcreteL (
    	Name As String,
    	ByRef FileName As String,
    	ByRef MatProp As String,
    	ByRef T3 As Double,
    	ByRef T2 As Double,
    	ByRef Tf As Double,
    	ByRef TwC As Double,
    	ByRef TwT As Double,
    	ByRef MirrorAbout2 As Boolean,
    	ByRef MirrorAbout3 As Boolean,
    	ByRef Color As Integer,
    	ByRef Notes As String,
    	ByRef GUID As String
    ) As Integer

    Dim instance As cPropFrame
    Dim Name As String
    Dim FileName As String
    Dim MatProp As String
    Dim T3 As Double
    Dim T2 As Double
    Dim Tf As Double
    Dim TwC As Double
    Dim TwT As Double
    Dim MirrorAbout2 As Boolean
    Dim MirrorAbout3 As Boolean
    Dim Color As Integer
    Dim Notes As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.GetConcreteL(Name,
    	FileName, MatProp, T3, T2, Tf, TwC,
    	TwT, MirrorAbout2, MirrorAbout3,
    	Color, Notes, GUID)

    int GetConcreteL(
    	String^ Name,
    	String^% FileName,
    	String^% MatProp,
    	double% T3,
    	double% T2,
    	double% Tf,
    	double% TwC,
    	double% TwT,
    	bool% MirrorAbout2,
    	bool% MirrorAbout3,
    	int% Color,
    	String^% Notes,
    	String^% GUID
    )

    abstract GetConcreteL :
            Name : string *
            FileName : string byref *
            MatProp : string byref *
            T3 : float byref *
            T2 : float byref *
            Tf : float byref *
            TwC : float byref *
            TwT : float byref *
            MirrorAbout2 : bool byref *
            MirrorAbout3 : bool byref *
            Color : int byref *
            Notes : string byref *
            GUID : string byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame section property.

FileName

    Type: SystemString
If the section property was imported from a property file, this is the name of
that file. If the section property was not imported, this item is blank.

MatProp

    Type: SystemString
The name of the material property for the section.

T3

    Type: SystemDouble

T2

    Type: SystemDouble

Tf

    Type: SystemDouble

TwC

    Type: SystemDouble
The vertical leg thickness at the corner. [L]

TwT

    Type: SystemDouble
The vertical leg thickness at the tip. [L]

MirrorAbout2

    Type: SystemBoolean
Indicates whether the section is mirrored about the local 2-axis.

MirrorAbout3

    Type: SystemBoolean
Indicates whether the section is mirrored about the local 3-axis.

Color

    Type: SystemInt32

Notes

    Type: SystemString

GUID

    Type: SystemString
The GUID (global unique identifier), if any, assigned to the section.

#### Return Value

Type: Int32
returns zero if the section property data is successfully retrieved; otherwise
it returns a nonzero value.

Remarks

This function supersedes GetAngle(String, String, String, Double, Double,
Double, Double, Int32, String,
String).

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1
           Dim Name As String
           Dim FileName As String
           Dim MatProp As String
           Dim t3 As Double
           Dim t2 As Double
           Dim tf As Double
           Dim twc As Double
           Dim twt As Double
           Dim mirror2 As Boolean
           Dim mirror3 As Boolean
           Dim Color As Integer
           Dim Notes As String
           Dim GUID As String

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'set new frame section property
           ret = SapModel.PropFrame.SetConcreteL("ANGLE1", "4000Psi", 30, 36, 8, 7, 5, False, True)

       'get frame section property data
           ret = SapModel.PropFrame.GetConcreteL("ANGLE1", FileName, MatProp, t3, t2, tf, twc, twt, mirror2, mirror3, Color, Notes, GUID)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com